app/controllers/application_controller.rb

    def get_current_user
        id = decoded_token['id']
        User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]