app/controllers/cycle_journals_controller.rb

SELECT "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cycle_journals".* FROM "cycle_journals" WHERE "cycle_journals"."cycle_id" = $1  [["cycle_id", 5]]
---
    def show
        cycle_journal = CycleJournal.find(params[:id])