app/controllers/entries_controller.rb

SELECT "cycle_journals".* FROM "cycle_journals" WHERE "cycle_journals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    cycle_journal = CycleJournal.find(params[:cycle_journal_id])