app/controllers/users_controller.rb

    def signin
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lope.ariyo@faker.com"], ["LIMIT", 1]]

    def current_cycle
        user = get_current_user
        cycle = user.cycles.last
---
SELECT "cycles".* FROM "cycles" WHERE "cycles"."user_id" = $1 ORDER BY "cycles"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]