app/models/user.rb

SELECT "cycles".* FROM "cycles" WHERE "cycles"."user_id" = $1  [["user_id", 1]]
---
    def current_cycle
        cycles.find {|cycle| cycle.cycle_length == nil}